In [102]:
import pandas as pd
import os

In [103]:
student_data = os.path.join("/Users/colli/OneDrive/Desktop/new_full_student_data_.csv")
student_df = pd.read_csv(student_data)
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324

In [104]:
student_df["student_name"]

0           Travis Martin
1           Michael Brown
2         Gabriela Lucero
3        Susan Richardson
4            Sherry Davis
               ...
19509       Robert Sawyer
19510        David Herman
19511          Megan Gill
19512          Lori Stone
19513         Anna Jensen
Name: student_name, Length: 19514, dtype: object

In [105]:
student_df.isna().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1968
math_score        982
school_type         0
school_budget       0
dtype: int64

In [106]:
student_df = student_df.dropna()
student_df.isna().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
school_budget    0
dtype: int64

In [107]:
student_df.duplicated().sum()

1836

In [108]:
student_df = student_df.drop_duplicates()
student_df.duplicated().sum()

0

In [109]:
student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [110]:
student_df['grade']

0         9th
1         9th
2         9th
3         9th
5         9th
         ...
19508    10th
19509    12th
19511    11th
19512    11th
19513    12th
Name: grade, Length: 14831, dtype: object

In [111]:
student_df['grade'] = student_df['grade'].str.replace('th', '')
student_df['grade']

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: object

In [112]:
student_df['grade'] = student_df['grade'].astype(int)
student_df.dtypes

student_id         int64
student_name      object
grade              int32
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [113]:
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9,Silva High School,69.7,80.3,Public,991918
5,74579444,Cynthia Johnson,9,Montgomery High School,63.5,76.9,Charter,893368

In [114]:
student_df['math_score'].mean()

64.67573326141189

In [115]:
min_reading_score = student_df['reading_score'].min()
print(min_reading_score)

10.5

In [116]:
student_df.loc[:,["grade"]]

       grade
0          9
1          9
2          9
3          9
5          9
...      ...
19508     10
19509     12
19511     11
19512     11
19513     12

[14831 rows x 1 columns]

In [117]:
student_df.iloc[[0,1,2], [3,4,5]]

            school_name  reading_score  math_score
0  Sullivan High School           59.0        88.2
1     Dixon High School           94.7        73.5
2    Wagner High School           89.0        70.4

In [118]:
grade_9_df = student_df.loc[student_df["grade"] == 9]
grade_9_df.describe()

         student_id   grade  reading_score   math_score  school_budget
count  4.132000e+03  4132.0    4132.000000  4132.000000    4132.000000
mean   6.979441e+07     9.0      69.236713    66.585624  898692.606002
std    3.470565e+07     0.0      15.277354    16.661533   54891.596611
min    1.000906e+07     9.0      17.900000     5.300000  817615.000000
25%    3.953848e+07     9.0      59.000000    56.000000  846745.000000
50%    6.984037e+07     9.0      70.050000    67.800000  893368.000000
75%    9.939504e+07     9.0      80.500000    78.500000  957299.000000
max    1.299997e+08     9.0      99.900000   100.000000  991918.000000

In [119]:
min_reading_row = student_df.loc[student_df["reading_score"] == min_reading_score]
min_reading_row

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
3706,81758630,Matthew Thomas,10,Dixon High School,10.5,58.4,Charter,870334

In [120]:
# Use loc with conditionals to select all reading scores from 10th graders at Dixon High School.
reading_scores = student_df.loc[
    (student_df['grade'] == 10) & 
    (student_df['school_name'] == 'Dixon High School'),
        ['school_name', 
        'reading_score']]
reading_scores

             school_name  reading_score
45     Dixon High School           71.1
60     Dixon High School           59.5
69     Dixon High School           88.6
94     Dixon High School           81.5
100    Dixon High School           95.3
...                  ...            ...
19283  Dixon High School           52.9
19306  Dixon High School           58.0
19344  Dixon High School           38.0
19368  Dixon High School           84.4
19445  Dixon High School           43.9

[569 rows x 2 columns]

In [121]:
# Find the mean reading score for all students in grades 11 and 12 combined.
reading_scores_mean = student_df.loc[
    (student_df['grade'] == 11 ) | (student_df['grade'] == 12),
        'reading_score'].mean()
reading_scores_mean

74.90038089192188

In [122]:
math_reading_school = student_df.groupby(by='school_type').mean()
math_reading_school.loc[:, ["math_score", "reading_score"]]

             math_score  reading_score
school_type
Charter       66.761883      72.450603
Public        62.951576      72.281219

In [123]:
student_count_by_school = student_df[['school_name', 'student_id']].groupby(by='school_name').count()
student_count_by_school = student_count_by_school.sort_values('student_id', ascending=False)
student_count_by_school

                        student_id
school_name
Montgomery High School        2038
Green High School             1961
Dixon High School             1583
Wagner High School            1541
Silva High School             1109
Woods High School             1052
Sullivan High School           971
Turner High School             846
Bowers High School             803
Fisher High School             798
Richard High School            551
Campos High School             541
Odonnell High School           459
Campbell High School           407
Chang High School              171

In [129]:
avg_math = student_df[['grade', 'math_score', 'school_type']].groupby(['school_type', 'grade']).mean()
avg_math

                   math_score
school_type grade
Charter     9       70.077874
            10      66.443206
            11      68.024735
            12      60.212121
Public      9       63.771066
            10      63.764121
            11      59.314337
            12      63.568319